 ## Pandas Series

In [2]:
import numpy as np
import pandas as pd

In [9]:
labelslist = ["Mustafa","Kemal","Murat","Kadir","Zeynep"]

In [10]:
datalist = [10,20,30,40,50]

In [11]:
pd.Series(data=datalist,index=labelslist)

Mustafa    10
Kemal      20
Murat      30
Kadir      40
Zeynep     50
dtype: int64

In [12]:
pd.Series(datalist,labelslist)

Mustafa    10
Kemal      20
Murat      30
Kadir      40
Zeynep     50
dtype: int64

In [13]:
pd.Series(datalist)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [14]:
npArray=np.array([10,20,30,40,50])

In [15]:
pd.Series(npArray)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [16]:
pd.Series(npArray,labelslist)

Mustafa    10
Kemal      20
Murat      30
Kadir      40
Zeynep     50
dtype: int32

In [17]:
pd.Series(data=npArray,index=["a","b","c","d","e"])

a    10
b    20
c    30
d    40
e    50
dtype: int32

In [18]:
dataDict={"Kadir":30,"Kemal":80,"Kamuran":60}

In [19]:
pd.Series(dataDict)

Kadir      30
Kemal      80
Kamuran    60
dtype: int64

In [23]:
ser2017 = pd.Series([5,10,14,20],["Buğday","Mısır","Kiraz","Erik"])

In [24]:
ser2017

Buğday     5
Mısır     10
Kiraz     14
Erik      20
dtype: int64

In [25]:
ser2018 = pd.Series([2,12,12,6],["Buğday","Mısır","Çilek","Erik"])

In [26]:
ser2018

Buğday     2
Mısır     12
Çilek     12
Erik       6
dtype: int64

In [27]:
ser2017+ser2018

Buğday     7.0
Erik      26.0
Kiraz      NaN
Mısır     22.0
Çilek      NaN
dtype: float64

In [28]:
total = ser2017+ser2018

In [29]:
total

Buğday     7.0
Erik      26.0
Kiraz      NaN
Mısır     22.0
Çilek      NaN
dtype: float64

In [30]:
total["Erik"]

26.0

In [31]:
total["Çilek"]

nan

## Dataframes

In [32]:
import numpy as np
import pandas as pd

In [33]:
from numpy.random import randn

In [34]:
randn(3)    ## gaussian distribution

array([ 1.21413543, -0.84797671,  1.01005674])

In [35]:
randn(3,3)    ## gaussian distribution

array([[ 0.71499977,  0.16181487, -1.06303662],
       [-0.13858407, -0.1516855 , -0.55156069],
       [ 0.90996063,  1.25256455,  0.48604991]])

In [36]:
df=pd.DataFrame(data=randn(3,3),index=["a","b","c"],columns=["Column1","Column2","Column3"])

In [42]:
df  ## dataframe'ler serilerin birleşimidir

    Column1   Column2   Column3
a -0.141910 -0.188189  0.570068
b  0.500321 -1.039895  0.079703
c -1.224305 -0.164060 -0.774389

In [38]:
df["Column1"]

a   -0.141910
b    0.500321
c   -1.224305
Name: Column1, dtype: float64

In [40]:
df["Column2"]

a   -0.188189
b   -1.039895
c   -0.164060
Name: Column2, dtype: float64

In [41]:
type(df["Column2"])

pandas.core.series.Series

In [43]:
df.loc["a"]

Column1   -0.141910
Column2   -0.188189
Column3    0.570068
Name: a, dtype: float64

In [44]:
type(df.loc["a"])

pandas.core.series.Series

In [45]:
df[["Column1","Column3"]]

    Column1   Column3
a -0.141910  0.570068
b  0.500321  0.079703
c -1.224305 -0.774389

In [58]:
df["Column4"]=pd.Series(randn(3),["a","b","c"])

In [59]:
df

    Column1   Column2   Column3   Column5   Column4
a -0.141910 -0.188189  0.570068  0.239969 -0.670519
b  0.500321 -1.039895  0.079703 -0.459871  1.537037
c -1.224305 -0.164060 -0.774389 -2.162753 -2.048541

In [60]:
df["Column5"]=df["Column1"]+df["Column2"]+df["Column3"]

In [61]:
df

    Column1   Column2   Column3   Column5   Column4
a -0.141910 -0.188189  0.570068  0.239969 -0.670519
b  0.500321 -1.039895  0.079703 -0.459871  1.537037
c -1.224305 -0.164060 -0.774389 -2.162753 -2.048541

In [62]:
df.drop("Column4",axis=1)    ## axis=1 : columns  ## axis=0 : index

    Column1   Column2   Column3   Column5
a -0.141910 -0.188189  0.570068  0.239969
b  0.500321 -1.039895  0.079703 -0.459871
c -1.224305 -0.164060 -0.774389 -2.162753

In [63]:
df

    Column1   Column2   Column3   Column5   Column4
a -0.141910 -0.188189  0.570068  0.239969 -0.670519
b  0.500321 -1.039895  0.079703 -0.459871  1.537037
c -1.224305 -0.164060 -0.774389 -2.162753 -2.048541

In [64]:
df.drop("Column4",axis=1,inplace=True)

In [65]:
df

    Column1   Column2   Column3   Column5
a -0.141910 -0.188189  0.570068  0.239969
b  0.500321 -1.039895  0.079703 -0.459871
c -1.224305 -0.164060 -0.774389 -2.162753

In [67]:
df.loc["a"]

Column1   -0.141910
Column2   -0.188189
Column3    0.570068
Column5    0.239969
Name: a, dtype: float64

In [68]:
df.iloc[0]

Column1   -0.141910
Column2   -0.188189
Column3    0.570068
Column5    0.239969
Name: a, dtype: float64

In [69]:
df.loc["a","Column1"]

-0.14191038201393724

In [70]:
df.loc["b","Column2"]

-1.039895044907967

In [73]:
df.loc[["a","b"],["Column1","Column2"]]

    Column1   Column2
a -0.141910 -0.188189
b  0.500321 -1.039895

## Dataframe Filter

In [75]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [77]:
df=pd.DataFrame(randn(4,3),["a","b","c","d"],["Column1","Column2","Column3"])

In [78]:
df

    Column1   Column2   Column3
a -1.781761 -0.010360  2.988874
b -1.018547  0.858232 -1.124682
c -1.298167 -0.867816 -1.736842
d -0.614831 -0.930460 -1.239502

In [79]:
df>-1

   Column1  Column2  Column3
a    False     True     True
b    False     True    False
c    False     True    False
d     True     True    False

In [80]:
df>0

   Column1  Column2  Column3
a    False    False     True
b    False     True    False
c    False    False    False
d    False    False    False

In [81]:
booldf=df>0

In [83]:
booldf

   Column1  Column2  Column3
a    False    False     True
b    False     True    False
c    False    False    False
d    False    False    False

In [84]:
df[booldf]

   Column1   Column2   Column3
a      NaN       NaN  2.988874
b      NaN  0.858232       NaN
c      NaN       NaN       NaN
d      NaN       NaN       NaN

In [85]:
df[df>0]

   Column1   Column2   Column3
a      NaN       NaN  2.988874
b      NaN  0.858232       NaN
c      NaN       NaN       NaN
d      NaN       NaN       NaN

In [86]:
df[df>-1]

    Column1   Column2   Column3
a       NaN -0.010360  2.988874
b       NaN  0.858232       NaN
c       NaN -0.867816       NaN
d -0.614831 -0.930460       NaN

In [87]:
df

    Column1   Column2   Column3
a -1.781761 -0.010360  2.988874
b -1.018547  0.858232 -1.124682
c -1.298167 -0.867816 -1.736842
d -0.614831 -0.930460 -1.239502

In [93]:
df["Column1"]

a   -1.781761
b   -1.018547
c   -1.298167
d   -0.614831
Name: Column1, dtype: float64

In [94]:
df["Column1"]>0

a    False
b    False
c    False
d    False
Name: Column1, dtype: bool

In [96]:
df[df["Column2"]>0]

    Column1   Column2   Column3
b -1.018547  0.858232 -1.124682

In [97]:
df["Column1"]>-1

a    False
b    False
c    False
d     True
Name: Column1, dtype: bool

In [99]:
df[df["Column1"]>-1]

    Column1  Column2   Column3
d -0.614831 -0.93046 -1.239502

In [101]:
df[df["Column2"]>-1]

    Column1   Column2   Column3
a -1.781761 -0.010360  2.988874
b -1.018547  0.858232 -1.124682
c -1.298167 -0.867816 -1.736842
d -0.614831 -0.930460 -1.239502

In [102]:
df[(df["Column1"]>-1)&(df["Column2"]>-1)]

    Column1  Column2   Column3
d -0.614831 -0.93046 -1.239502

In [103]:
df[(df["Column1"]>-1)|(df["Column2"]>-1)]

    Column1   Column2   Column3
a -1.781761 -0.010360  2.988874
b -1.018547  0.858232 -1.124682
c -1.298167 -0.867816 -1.736842
d -0.614831 -0.930460 -1.239502

In [104]:
df["Column4"]=pd.Series(randn(4),["a","b","c","d"])

In [105]:
df

    Column1   Column2   Column3   Column4
a -1.781761 -0.010360  2.988874  0.350777
b -1.018547  0.858232 -1.124682  0.751822
c -1.298167 -0.867816 -1.736842 -0.304633
d -0.614831 -0.930460 -1.239502  0.332682

In [106]:
df["Column5"]=randn(4)

In [107]:
df

    Column1   Column2   Column3   Column4   Column5
a -1.781761 -0.010360  2.988874  0.350777 -0.003474
b -1.018547  0.858232 -1.124682  0.751822 -0.074688
c -1.298167 -0.867816 -1.736842 -0.304633  0.239869
d -0.614831 -0.930460 -1.239502  0.332682  0.489488

In [108]:
df["Column6"]=["newVal1","newVal2","newVal3","newVal4"]

In [109]:
df

    Column1   Column2   Column3   Column4   Column5  Column6
a -1.781761 -0.010360  2.988874  0.350777 -0.003474  newVal1
b -1.018547  0.858232 -1.124682  0.751822 -0.074688  newVal2
c -1.298167 -0.867816 -1.736842 -0.304633  0.239869  newVal3
d -0.614831 -0.930460 -1.239502  0.332682  0.489488  newVal4

In [110]:
df.set_index("Column6")

          Column1   Column2   Column3   Column4   Column5
Column6
newVal1 -1.781761 -0.010360  2.988874  0.350777 -0.003474
newVal2 -1.018547  0.858232 -1.124682  0.751822 -0.074688
newVal3 -1.298167 -0.867816 -1.736842 -0.304633  0.239869
newVal4 -0.614831 -0.930460 -1.239502  0.332682  0.489488

In [111]:
df

    Column1   Column2   Column3   Column4   Column5  Column6
a -1.781761 -0.010360  2.988874  0.350777 -0.003474  newVal1
b -1.018547  0.858232 -1.124682  0.751822 -0.074688  newVal2
c -1.298167 -0.867816 -1.736842 -0.304633  0.239869  newVal3
d -0.614831 -0.930460 -1.239502  0.332682  0.489488  newVal4

In [113]:
df.set_index("Column6",inplace=True)

In [114]:
df

          Column1   Column2   Column3   Column4   Column5
Column6
newVal1 -1.781761 -0.010360  2.988874  0.350777 -0.003474
newVal2 -1.018547  0.858232 -1.124682  0.751822 -0.074688
newVal3 -1.298167 -0.867816 -1.736842 -0.304633  0.239869
newVal4 -0.614831 -0.930460 -1.239502  0.332682  0.489488

In [115]:
df.index.names

FrozenList(['Column6'])